/**
 * @fileoverview Оригинальные ASCII-ассеты "Epic Retro HUD" для заставки TypeTip Studio.
 * Разметки оптимизированы под посимвольный рендеринг в двумерную матрицу (Grid).
 * 符合 Google TypeScript СТИЛЬ ПРАВИЛ / ПОСТРОЧНОЕ КОММЕНТИРОВАНИЕ
 * © The 'Just Make It Work' Group Vibe Coding Enterprises Corporation //™
 */

export const ANSI_ASSETS = {
  /** Базовый системный промпт для вывода на нижней строке терминала */
  PROMPT_BASE: "root@typetip:/home# useradd -m typetip",

  /**
   * Эпичный ретро-шрифт TERMINAL (Отображает: TYPETIP)
   * Ширина: 75 символов, Высота: 7 строк.
   */
  DOT_TERMINAL: [
    "      :::::::::::  :::2026:::  ::::::::::  :::::::::: ::::::::::: ::::::::: ",
    "         :+:      :+:    :+: :+:        :+:            :+:    :+:    :+:     ",
    "         +:+      +:+    +:+ +:+        +:+            +:+    +:+    +:+     ",
    "         +#+      +#+    +:+ +#++:++#   +#++:++#        +#+    +#++:++#+      ",
    "         +#+      +#+    +#+ +#+        +#+            +#+    +#+            ",
    "         #+#      #+#    #+# #+#        #+#            #+#    #+#            ",
    "         ###        ########  ########## ########### ########### ###          "
  ],

  /**
   * Эпичный ретро-шрифт READY (Отображает: STUDIO)
   * Идеально выровнен по ширине для центрирования под блоком TERMINAL.
   */
  DOT_READY: [
    " ::::::::: ::::::::::     :::::   :::::::::  :::   :::                      ",
    " :+:    :+: :+:          :+:    :+: :+:    :+: :+:   :+:                      ",
    " +:+    +:+ +:+          +:+    +:+ +:+    +:+  +:+ +:+                       ",
    " +#++:++#+  +#++:++#     +#+    +:+ +#+    +:+   +#++:                        ",
    " +#+    +#+ +#+          +#+    +:+ +#+    +:+    +#+                         ",
    " #+#    #+# #+#          #+#    +:+ #+#    +:+    #+#                         ",
    " #########  ##########     #####   #########      ###                         "
  ],

  /** Центральная кнопка запуска */
  PRESS_ANY_KEY: "---===[ PLEASE ANY KEY SIR ]==═---",

  /** Корпоративная сигнатура с панчем */
  SIGNATURE: "TJMIWGVCEC // Enterprise Code на коленке BY ЖМИНЯ"
};